openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Mcu.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/


#include <assert.h>
#include <string.h>
#include "Std_Types.h"
#include "Mcu.h"
#include "Det.h"
#if defined(USE_DEM)
#include "Dem.h"
#endif
#include "mpc55xx.h"
#include "Cpu.h"
#include "Ramlog.h"
#include "Os.h"
#include "isr.h"

//#define USE_LDEBUG_PRINTF 1
#include "debug.h"

#define SYSCLOCK_SELECT_PLL	0x2

#if defined(CFG_MPC5567)
#define CALC_SYSTEM_CLOCK(_extal,_emfd,_eprediv,_erfd)  \
            ( (_extal) * ((_emfd)+4) / (((_eprediv)+1)*(1<<(_erfd))) )
#elif defined(CFG_MPC560X)
#define CALC_SYSTEM_CLOCK(_extal,_emfd,_eprediv,_erfd)  \
	        ( (_extal)*(_emfd) / ((_eprediv+1)*(2<<(_erfd))) )
#else
#define CALC_SYSTEM_CLOCK(_extal,_emfd,_eprediv,_erfd)  \
            ( (_extal) * ((_emfd)+16) / (((_eprediv)+1)*((_erfd)+1)) )
#endif

typedef void (*vfunc_t)();

/* Function declarations. */
static void Mcu_ConfigureFlash(void);

typedef struct{
	uint32 lossOfLockCnt;
	uint32 lossOfClockCnt;
} Mcu_Stats;

/**
 * Type that holds all global data for Mcu
 */
typedef struct
{
    // Set if Mcu_Init() have been called
    boolean initRun;
    // Our config
    const Mcu_ConfigType *config;
    Mcu_ClockType clockSetting;
    Mcu_Stats stats;
} Mcu_GlobalType;

/* Development error macros. */
#if ( MCU_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_MCU,0,_api,_err); \
          return; \
        }

#define VALIDATE_W_RV(_exp,_api,_err,_rv ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_MCU,0,_api,_err); \
          return (_rv); \
        }
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_W_RV(_exp,_api,_err,_rv )
#endif

// Global config
Mcu_GlobalType Mcu_Global =
{
	.initRun = 0,
	.config = &McuConfigData[0],
};

//-------------------------------------------------------------------

void Mcu_LossOfLock( void  ){
#if defined(USE_DEM)
	Dem_ReportErrorStatus(MCU_E_CLOCK_FAILURE, DEM_EVENT_STATUS_FAILED);
#endif

  /*
   * NOTE!!!
   * This interrupt may be triggered more than expected.
   * If you are going to use this interrupt, see [Freescale Device Errata MPC5510ACE, Rev. 10 APR 2009, errata ID: 6764].
   *
   */
#if defined(CFG_MPC560X)
	/*not support*/
#else
	Mcu_Global.stats.lossOfLockCnt++;
	// Clear interrupt
	FMPLL.SYNSR.B.LOLF = 1;
#endif
}

//-------------------------------------------------------------------

void Mcu_LossOfClock( void  ){
	/* Should report MCU_E_CLOCK_FAILURE with DEM here */
#if defined(CFG_MPC560X)
	/*not support*/
#else
	Mcu_Global.stats.lossOfClockCnt++;
	// Clear interrupt
	FMPLL.SYNSR.B.LOCF = 1;
#endif
}

#define SPR_PIR 286
#define SPR_PVR 287

#define CORE_PVR_E200Z1   	0x81440000UL
#define CORE_PVR_E200Z0   	0x81710000UL
#define CORE_PVR_E200Z3 	0x81120000UL
#define CORE_PVR_E200Z6   	0x81170000UL
#define CORE_PVR_E200Z65   	0x81150000UL	/* Is actually a 5668 */
#define CORE_PVR_E200Z0H   	0x817F0000UL

typedef struct{
	char *name;
	uint32 pvr;
} core_info_t;

typedef struct{
	char *name;
	uint32 pvr;
} cpu_info_t;

const cpu_info_t cpu_info_list[] = {
#if defined(CFG_MPC5516)
    {
    	.name = "MPC5516",
    	.pvr = CORE_PVR_E200Z1,
    },
    {
    	.name = "MPC5516",
    	.pvr = CORE_PVR_E200Z0,
    },
#elif defined(CFG_MPC5567)
    {
    	.name = "MPC5567",
    	.pvr = CORE_PVR_E200Z6,
    }
#elif defined(CFG_MPC5633)
    {
    	.name = "MPC563X",
    	.pvr = CORE_PVR_E200Z3,
    },
#elif defined(CFG_MPC5604B)
    {
    	.name = "MPC5604B",
    	.pvr = CORE_PVR_E200Z0H,
    },
#elif defined(CFG_MPC5606B)
    {
    	.name = "MPC5606B",
    	.pvr = CORE_PVR_E200Z0H,
    },
#elif defined(CFG_MPC5606S)
    {
    	.name = "MPC5606S",
    	.pvr = CORE_PVR_E200Z0H,
    },
#elif defined(CFG_MPC5668)
	{
		.name = "MPC5668",
		.pvr = CORE_PVR_E200Z65,
	},
	{
		.name = "MPC5668",
		.pvr = CORE_PVR_E200Z0,
	},
#endif
};

const core_info_t core_info_list[] = {
#if defined(CFG_MPC5516)
	{
		.name = "CORE_E200Z1",
		.pvr = CORE_PVR_E200Z1,
    },
    {
    	.name = "CORE_E200Z1",
    	.pvr = CORE_PVR_E200Z1,
    },
#elif defined(CFG_MPC5567)
    {
    	.name = "CORE_E200Z6",
    	.pvr = CORE_PVR_E200Z6,
    }
#elif defined(CFG_MPC5633)
    {
		.name = "CORE_E200Z3",
		.pvr = CORE_PVR_E200Z3,
    },
#elif defined(CFG_MPC5604B)
    {
    	.name = "MPC5604B",
    	.pvr = CORE_PVR_E200Z0H,
    },
#elif defined(CFG_MPC5606B)
    {
    	.name = "MPC5606B",
    	.pvr = CORE_PVR_E200Z0H,
    },
#elif defined(CFG_MPC5606S)
    {
    	.name = "MPC5606S",
    	.pvr = CORE_PVR_E200Z0H,
    },
#elif defined(CFG_MPC5668)
    {
    	.name = "CORE_E200Z65",
    	.pvr = CORE_PVR_E200Z65,
    },
    {
    	.name = "CORE_E200Z0",
    	.pvr = CORE_PVR_E200Z1,
    },
#endif
};

// TODO: move
#if !defined(ARRAY_SIZE)
#define ARRAY_SIZE(_x)  (sizeof(_x)/sizeof((_x)[0]))
#endif

static const cpu_info_t *Mcu_IdentifyCpu(uint32 pvr)
{
    int i;

    for (i = 0; i < ARRAY_SIZE(cpu_info_list); i++) {
    	if (cpu_info_list[i].pvr == pvr) {
    		return &cpu_info_list[i];
        }
    }

